pehill-5-cases-OpenFOAM/case_0p8/0/Tau
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      Tau;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
14751
(
(5.8161e-09 4.49832e-11 4.49354e-35 5.81604e-09 -2.75873e-38 5.81607e-09)
(1.10284e-07 3.01756e-09 -7.9044e-32 1.10277e-07 -5.11415e-32 1.10281e-07)
(4.46032e-07 2.24178e-08 2.23102e-29 4.45955e-07 -2.71409e-32 4.45996e-07)
(1.17313e-06 1.02236e-07 5.16222e-30 1.17275e-06 4.98588e-30 1.17295e-06)
(2.36288e-06 3.53695e-07 -1.43748e-27 2.36177e-06 -8.69719e-30 2.36236e-06)
(3.70874e-06 7.93153e-07 4.42708e-27 3.70764e-06 -3.68612e-29 3.70831e-06)
(4.76471e-06 1.21442e-06 -1.37908e-28 4.76699e-06 5.42151e-29 4.76606e-06)
(5.43412e-06 1.52631e-06 3.95734e-28 5.44489e-06 -1.32204e-30 5.4398e-06)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (6.66667e-16 -0 0 6.66667e-16 -0 6.66667e-16);
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (6.66667e-16 0 0 6.66667e-16 0 6.66667e-16);
    }
}


// ************************************************************************* //
