pehill-5-cases-OpenFOAM/case_0p8/0/UDNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
14751
(
(1.670148029689285524e-03 3.820983721338573156e-08 -1.009833813276945520e-07)
(1.667444645611251223e-03 1.126700409845865338e-07 -4.635937253554335505e-08)
(1.662640356534575252e-03 1.512657314422453544e-07 7.377029953012734992e-09)
(1.655782418825450623e-03 2.496119546474834899e-07 6.514820995145180656e-08)
(1.646975310876722109e-03 2.521359516097739461e-07 1.082549245021167912e-07)
(1.636289464356272157e-03 3.649508060760015741e-07 1.429227511031743160e-07)
(1.623771160430426304e-03 3.738534933620225642e-07 1.736610440292496721e-07)
(1.609557427626544593e-03 4.535282470665189853e-07 1.985169158519191754e-07)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}